import React, { Dispatch, SetStateAction } from "react";
import Div from "../HtmlTools/Div";
import SpanHover from "../HtmlTools/SpanHover";
interface MoviesProps {
  activeSub: number;
  setActiveSub: Dispatch<SetStateAction<number>>;
}

export default function Movies({ activeSub, setActiveSub }: MoviesProps) {
  // 1. وضع جميع التصنيفات في مصفوفة ليسهل التحكم بها
  const movieCategories = [
    "أفضل الأفلام بصوت دولبي 4K 3840p",
    "أفضل الأفلام بجودة بلوراي متعددة الترجمة",
    "نتفليكس بصوت دولبي 4K 3840p",
    "نتفليكس بصوت دولبي",
    "نتفليكس", "أمازون", "أفلام ديزني", "آبل بلس",
    "ماكس 4K 3840p", "ماكس", "يونيفرسال", "باراماونت بلس",
    "بيكوك", "أفلام مارفل", "أفلام الدول الاسكندنافية 4K بصوت دولبي",
    "أفلام آيسلندا 4K بصوت دولبي", "أفلام أو إس إن بلس 4K",
    "أفلام عربية 4K بصوت دولبي", "أفلام عربية فائقة الوضوح",
    "أفلام عربية بصوت دولبي", "أفلام نجوم العرب", "أفلام عادل إمام",
    "أفلام أحمد حلمي", "أفلام أحمد عز", "أفلام كريم عبد العزيز",
    "أفلام أحمد السقا", "أفلام محمد هنيدي", "أفلام هاني رمزي",
    "أفلام دريد لحام", "أفلام عربية حديثة", "أفلام عربية قديمة",
    "أفلام شاهد الأصلية", "أفلام شامية", "أفلام مصرية", "أفلام خليجية",
    "أفلام مغربية", "أفلام تونسية", "أفلام جزائرية", "أفلام ليبية",
    "أفلام عربية كلاسيكية", "أفلام مدبلجة للعربية", "أفلام كوميدية",
    "أفلام تُعرض في السينما العربية", "أفلام مسيحية",
    "أفلام أجنبية فائقة الوضوح", "أفلام جيمس بوند 007",
    "أفلام أجنبية ترند", "أفلام أجنبية 2027", "أفلام أجنبية 2026",
    "أفلام أجنبية 2025", "أفلام أجنبية 2024", "أفلام أجنبية 2023",
    "أفلام أجنبية 2022", "أفلام أجنبية 2021", "أفلام أجنبية 2020",
    "أفلام أجنبية 2019", "أفلام أجنبية 2018", "أفلام أجنبية قديمة",
    "أفلام تُعرض في السينما الأجنبية", "أفلام الكريسماس",
    "أفلام آسيوية 2027", "أفلام آسيوية 2026", "أفلام آسيوية 2025",
    "أفلام آسيوية 2024", "أفلام آسيوية 2023", "أفلام آسيوية 2022",
    "أفلام آسيوية قديمة", "أفلام هندية 2027", "أفلام هندية 2026",
    "أفلام هندية 2025", "أفلام هندية 2024", "أفلام هندية 2023",
    "أفلام هندية قديمة", "أفلام هندية مدبلجة", "أفلام ألمانية 2026",
    "أفلام ألمانية 2025", "أفلام ألمانية 2024", "أفلام ألمانية 2023",
    "أفلام ألمانية قديمة", "أفلام رعب", "أفلام أطفال فائقة الوضوح",
    "أفلام أطفال", "أفلام أنمي", "أفلام تركية مترجمة", "أفلام تركية مدبلجة",
    "أفلام إسلامية", "أفلام ناشيونال جيوغرافيك", "أفلام وثائقية مترجمة",
    "أفلام وثائقية مدبلجة", "الجزيرة الوثائقية"
  ];

  return (
    <Div>

   

    
          {movieCategories.map((category, index) => (
            <SpanHover 
              key={index} 
            >
              {category}
            </SpanHover>
          ))}
       
    </Div>
  );
}