// data_seo/home_seo.ts

import { text } from "stream/consumers";

export const HomeMeta = {
  title: "أفضل اشتراك IPTV في المغرب 2026 – سيرفرات بدون تقطيع ودعم فني مباشر", // <--- هنا اكتب عنوان الموقع
  description:"IPTVFORJA هو الخيار الافضل لعام 2026 يوفر لك اشتراكاً رسمياً يضم أكثر من 46,000 قناة بجودة HD وFull HD وUltra HD و2K و4K و8K ... مع مكتبة أفلام ومسلسلات ضخمة تحديث يومياً، لضمان تجربة مشاهدة مستقرة.", // <--- هنا اكتب الوصف
 keywords: "iptvforja, forja iptv, forja tv, أفضل اشتراك IPTV في المغرب 2026, اشتراك iptv رسمي, أفضل سيرفر اي بي تي في, Abonnement IPTV Maroc, IPTV Smart Player, سيرفر بدون تقطيع, كيف احصل على اشتراك IPTV",
  url: "https://iptvforja.com", // <--- هنا اكتب رابط موقعك الكامل
  image: "https://your-site.com/share-image.jpg", // <--- هنا ضع رابط صورة لمشاركتها في واتساب
};

export const HomeSchema = {  
  "@context": "https://schema.org",
  "@graph": [
    {
      "@type": "Product",
      name: "IPTVFORJA", // <--- هنا اكتب اسم الخدمة
      image: HomeMeta.image,
      description: HomeMeta.description,
      brand: {
        "@type": "Brand",
        name: "IPTVFORJA", // <--- هنا اكتب اسم شركتك أو موقعك
      },
      aggregateRating: {
        "@type": "AggregateRating",
        ratingValue: "4.9", // <--- هنا اكتب التقييم (مثلاً 4.8 أو 5)
        reviewCount: "1500", // <--- هنا اكتب عدد التقييمات التي تريد إظهارها
      },
      offers: {
        "@type": "AggregateOffer",
        priceCurrency: "MAD", // <--- هنا اكتب العملة (MAD للمغرب)
        lowPrice: "50", // <--- هنا اكتب أقل سعر عندك
        highPrice: "349", // <--- هنا اكتب أعلى سعر عندك
        offerCount: "4", // <--- هنا اكتب عدد الباقات المتوفرة
      },
    },
    {
      "@type": "FAQPage",
      mainEntity: [
         {
          "@type": "Question",
          name: "ما الذي يميز اشتراك IPTV الأكثر كفاءة… بجودة عالية، بدون تقطيع، وبثّ ثابت 24/7", // <--- هنا اكتب السؤال 0
          acceptedAnswer: {
            "@type": "Answer",
            text: " IPTVFORJA يقدم لك اشتراك IPTV يعتمد على سيرفرات مستقرة عالية الأداء، مصممة لضمان سرعة التنقل بين القنوات بدون أي بطء أو انقطاعات.", // <--- هنا اكتب الجواب 0
          },
        },
             {
          "@type": "Question",
          name: "ما هي القنوات التي يمكنني الحصول عليها عبر خدمة IPTV", // <--- هنا اكتب السؤال 1
          acceptedAnswer: {
            "@type": "Answer",
            text: "IPTVFORJA تمنحك وصولاً شاملاً ومباشراً إلى أكبر مكتبة قنوات في العالم، منظمة ومقسمة بدقة لتناسب كافة اهتماماتك واحتياجاتك. إليك تفاصيل المحتوى الذي ستحصل عليه:",
          },
        },

         {
          "@type": "Question",
          name: "ما هي الأجهزة التي يدعمها اشتراك IPTV", // <--- هنا اكتب السؤال 2
          acceptedAnswer: {
            "@type": "Answer",
            text: " IPTVFORJA يعمل على جميع الاجهزه  سواء كان لديك شاشة سمارت، هاتف (أندرويد أو آيفون)، تي في بوكس، أو حتى حاسوب. نوفر لك أدلة شرح مبسطة لكل جهاز لضمان التشغيل في دقائق.",
          },
        },
         {
          "@type": "Question",              
          name: "هل أحتاج لسرعة إنترنت عالية لتشغيل IPTV", // <--- هنا اكتب السؤال 3
          acceptedAnswer: {
            "@type": "Answer",
            text: "IPTVFORJA مصممة بذكاء لتناسب كافة السرعات؛ حيث نوفر جودات تبدأ من SD للإنترنت الضعيف وصولاً إلى8K    نظامنا يختار الجودة الأنسب لاتصالك تلقائياً لمنع التقطيع.",
          },
        },
           {
          "@type": "Question",              
          name: "كم ثمن اشتراك IPTV في المغرب مع IPTVFORJA", // <--- هنا اكتب السؤال 4
          acceptedAnswer: {
            "@type": "Answer",
            text: "تقدم IPTVFORJA باقات تنافسية تبدأ من 89 درهم. توفر لك أعلى جودة بث في المغرب مع ضمان استقرار السيرفر 100%، وتفعيل فوري عبر طرق الدفع المحلية المريحة.",
          },
        },
          {
          "@type": "Question",              
          name: "دعم فني مباشر على مدار الساعة", // <--- هنا اكتب السؤال 5
          acceptedAnswer: {
            "@type": "Answer",
            text: "لا تقلق بشأن الإعدادات التقنية، فريق IPTVFORJA متاح لخدمتك فوراً. نوفر لك مساعدة مباشرة لتشغيل اشتراكك وحل أي عوائق تقنية قد تواجهك، مع تحديثات مستمرة للسيرفرات لضمان أفضل أداء واستقرار",
          },
        },
          {
          "@type": "Question",              
          name: "مكتبة أفلام ومسلسلات VOD – أكثر من 153859 فيلم و39949 مسلسل", // <--- هنا اكتب السؤال 6
          acceptedAnswer: {
            "@type": "Answer",
            text: "استمتع بأضخم مكتبة أفلام ومسلسلات VOD تضم أكثر من 153,859 فيلماً و39,949 مسلسلاً تحديثات يوميا",
          },
        },
          {
          "@type": "Question",              
          name: "اشتراك IPTVFORJA مجاني لمدة 12 ساعة – بدون تقطيع – وبدون بيانات مصرفية", // <--- هنا اكتب السؤال 7
          acceptedAnswer: {
            "@type": "Answer",
            text: "✓ اشتراك IPTVFORJA يجمع بين الجودة العالية والاستقرار التام لضمان مشاهدة ممتعة.",
          },
        },
           {
          "@type": "Question",
          name: "هل تتمتع خدمة IPTVFORJA بجودة جيدة؟", // <--- هنا اكتب السؤال 8
          acceptedAnswer: {
            "@type": "Answer",
            text: "نعم، يوفر IPTVFORJA بثاً ثابتاً بجودة ممتازة 8K و HD دون انقطاع. يضمن لك تغطية رياضية موثوقة للمباريات الكبرى مع إعداد سهل وسريع يدعم كافة أنواع الأجهزة الذكية ومختلف .", // <--- هنا اكتب الجواب 8
          },
        },
         
                     {
          "@type": "Question",
          name: "سرعة بث وثبات IPTVFORJA لا يقارن", // <--- هنا اكتب السؤال 9
          acceptedAnswer: {
            "@type": "Answer",
            text: "نوفر لك أقوى السيرفرات العالمية لاكتشاف سرعة التنقل بين القنوات وتنوع المحتوى الضخم. جرّب الخدمة الآن وتعرف على الفرق في الجودة والأداء بنفسك لتشترك معنا بكل ثقة.", // <--- هنا اكتب الجواب 9
          },
        },
       //-------------------------------------------------------------------------------------------------------

          {
          "@type": "Question",
          name: "هل يوفر IPTVFORJA تغطية عالمية؟", // <--- هنا اكتب السؤال 
          acceptedAnswer: {
            "@type": "Answer",
            text: "نعم، يمكنك المشاهدة من أي دولة.... مثل المغرب، السعودية، أوروبا والخليج... بدون قيود.", // <--- هنا اكتب الجواب 
          },
        },

          {
          "@type": "Question",
          name: "هل البث مستقر في IPTVFORJA؟", // <--- هنا اكتب السؤال 
          acceptedAnswer: {
            "@type": "Answer",
            text: "نعم، البث ثابت ويعمل 24/7 بدون تقطيع.", // <--- هنا اكتب الجواب 
          },
        },

          {
          "@type": "Question",
          name: "ما هي باقات الاشتراك في IPTVFORJA؟", // <--- هنا اكتب السؤال 
          acceptedAnswer: {
            "@type": "Answer",
            text: "يوفر باقات متعددة (شهر، 3 أشهر، 6 أشهر، سنة) مع تفعيل فوري خلال ثوانٍ.", // <--- هنا اكتب الجواب 
          },
        },

          {
          "@type": "Question",
          name:"اشتراك IPTVFORJA مجاني لمدة 12 ساعة – بدون تقطيع – وبدون بيانات مصرفية", // <--- هنا اكتب السؤال 
          acceptedAnswer: {
            "@type": "Answer",
            text: "شتراك IPTVFORJA يجمع بين الجودة العالية والاستقرار التام لضمان مشاهدة ممتعة", // <--- هنا اكتب الجواب 
          },
        },

       
          {
          "@type": "Question",
          name: "", // <--- هنا اكتب السؤال 1
          acceptedAnswer: {
            "@type": "Answer",
            text: "", // <--- هنا اكتب الجواب 1
          },
        },
        //--------------------------------------------------------
        {
          "@type": "Question",
          name: "ما هو أفضل موقع للحصول على خدمات IPTV في المغرب لعام 2026؟", // <--- هنا اكتب السؤال 1
          acceptedAnswer: {
            "@type": "Answer",
            text: "يعتبر موقع IPTVFORJA من أفضل المواقع التي تقدم خدمات IPTV حالياً، وذلك بفضل استقرار السيرفرات (Uptime 99.9%)، وتوفير أكثر من 46,000 قناة بجودة 4K و 8K. ما يميزنا هو الدعم الفني المباشر وتحديث مكتبة الأفلام والمسلسلات (VOD) يومياً لضمان أفضل تجربة مشاهدة بدون تقطيع.", // <--- هنا اكتب الجواب 1
          },
        },
        {
          "@type": "Question",
          name: "هل يعمل الاشتراكIPTV بدون تقطيع أثناء المباريات الكبرى؟", // <--- هنا اكتب السؤال 2
          acceptedAnswer: {
            "@type": "Answer",
            text: "نعم، سيرفرات IPTVFORJA مزودة بتقنية Anti-Freeze وموزعة على مراكز بيانات قوية تضمن الثبات التام حتى في أوقات الذروة والمباريات العالمية.", // <--- هنا اكتب الجواب 2
          },
        },
         {
          "@type": "Question",
          name: "هل يمكنني تشغيل الاشتراك على أكثر من جهاز؟", // <--- هنا اكتب السؤال 2
          acceptedAnswer: {
            "@type": "Answer",
            text: "IPTVFORJA يدعم العمل على جميع الأجهزة Smart TV,Google TV,Smart TV, OS, Android Box, Mag, Smartphone, PC, iOS, iPadOS ,Windows ,..... يمكنك تشغيلIPTVFORJA على عدة أجهزة، لكن البث يعمل على جهاز واحد في نفس الوقت (إلا في حال اختيار باقة الأجهزة المتعددة).  ", // <--- هنا اكتب الجواب 2
          },
        },
         {
          "@type": "Question",
          name: "كيف سأتوصل ببيانات الاشتراك بعد الدفع؟", // <--- هنا اكتب السؤال 2
          acceptedAnswer: {
            "@type": "Answer",
            text: "فريق الدعم IPTVFORJA  يعتمد على نظام التسليم الفوري. بمجرد إتمام عملية الدفع، ستصلك بيانات  الاشتراك (Host, User, Password) عبر الواتساب  مع فيديو توضيحي لطريقة التفعيل.", // <--- هنا اكتب الجواب 2
          },
        },
         {
          "@type": "Question",
          name: "ماذا أفعل إذا واجهت مشكلة في التشغيل اشتراك iptvforja؟", // <--- هنا اكتب السؤال 2
          acceptedAnswer: {
            "@type": "Answer",
            text: "IPTVFORJA يوفر دعماً فنياً مباشراً عبر الواتساب على مدار الساعة فريقنا التقني مستعد لمساعدتك في إعداد الاشتراك على جهازك وحل أي مشكلة قد تواجهك فوراً ", // <--- هنا اكتب الجواب 2
          },
        },
         {
          "@type": "Question",
          name: "لماذا يُعد IPTVFORJA أفضل مزود خدمة في المغرب؟", // <--- هنا اكتب السؤال 2
          acceptedAnswer: {
            "@type": "Answer",
            text: "IPTVFORJA هو افضل اشتراك IPTV بدون تقطيع  في عام 2026  لانه يجمع بين السعر المنافس، الجودة العالية، وخدمة ما بعد البيع. نحن لا نبيعك اشتراكاً فقط، بل نضمن لك تجربة مشاهدة ممتعة ومستقرة طيلة مدة  اشتراك ", // <--- هنا اكتب الجواب 2
          },
        },
        
        
      ],
    },
    {
      "@type": "Organization",
      name: "IPTVFORJA", // <--- هنا اكتب اسم الموقع
      url: HomeMeta.url,
      logo: "https://your-site.com/logo.png", // <--- هنا ضع رابط شعار موقعك (اللوجو)
    },
    
  ],
};
